Repository: 84000/data-translation-memory
Catalog: toh216-v3.tmx
Source language: bo
Languages: en

source: །ཤཱ་རིའི་བུ་རྒྱལ་པོ་མ་སྐྱེས་དགྲ་འདི་བསྐལ་པ་གྲངས་མེད་པ་ཕྲག་བརྒྱད་བརྒྱ་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཏེ།
en: Śāriputra, in eight hundred countless eons, King Ajātaśatru will fully awaken to unsurpassed and perfect buddhahood.

source: བསྐལ་པ་མཐོང་ན་དགའ་བ་ཞེས་བྱ་བ་ལ་འཇིག་རྟེན་གྱི་ཁམས་འདམ་གྱི་རྙོག་པ་མེད་པར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཡུལ་ཤིན་ཏུ་རྣམ་པར་དག་པ་ཞེས་བྱ་བར་འགྱུར་ཏེ།
en: During the eon called Priyadarśana, in a world called Free of Sullying Mud, he will become the thus-gone, worthy, perfect Buddha Suviśuddhaviṣaya.

source: དེའི་ཚེའི་ཚད་ནི་བསྐལ་པ་བར་མ་བཞིར་འགྱུར་རོ།
en: His life will span four intermediate eons.

source: །དེའི་ཉན་ཐོས་ཀྱི་ཚོགས་ནི་བདུན་འབུམ་དུ་འགྱུར་ཏེ། ཐམས་ཅད་ཀྱང་ཤེས་རབ་ཀྱིས་མོས་པ་རྣམ་པར་ཐར་པ་བརྒྱད་ལ་བསམ་གཏན་བྱེད་པ་ཤ་སྟག་གོ།
en: His assembly of hearers will number seven hundred thousand, all of whom will be inspired by insight and solely engaged in concentration in the eight emancipations.

source: །དེའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་བྱེ་བ་ཕྲག་བཅུ་གཉིས་སུ་འགྱུར་ཏེ། ཐམས་ཅད་ཀྱང་ཐབས་དང་ཤེས་རབ་ལས་བྱུང་བ་ཤ་སྟག་གོ།
en: His bodhisattva great beings will number one hundred twenty million, all of whom will manifest through skillful means and insight.

source: །དེ་བཞིན་གཤེགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་དམ་པའི་ཆོས་ནི་ལོ་བྱེ་བར་གནས་པར་འགྱུར་རོ།
en: Once this thus-gone one enters parinirvāṇa, his sublime Dharma will remain for ten million years.

source: །འདམ་གྱི་དྲི་མ་མེད་པའི་འཇིག་རྟེན་གྱི་ཁམས་དེ་ན་སེམས་ཅན་གང་ཡང་འགྱོད་པ་ལ་གནས་ཤིང་འཆི་བའི་དུས་བྱེད་པར་མི་འགྱུར་རོ།
en: No beings in the world Free of Sullying Mud will reach their deaths while feeling remorse.

source: །དེ་ནས་ཤི་འཕོས་ནས་ཀྱང་འགྲོ་བ་ངན་པ་གསུམ་དུ་སྐྱེ་བར་འགྱུར་བ་གང་ཡང་མེད་དོ།
en: None of them will die and transmigrate such that they are born in the three lower realms.

source: །ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་ཡུལ་ཤིན་ཏུ་རྣམ་པར་དག་པ་དེ་ལ་སེམས་ཅན་གང་དག་ཆོས་ཉན་པ་དེ་དག་ཀུན་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་རྣམ་པར་དག་པར་འགྱུར་རོ།
en: Śāriputra, everyone who hears the Dharma from the thus-gone Suviśuddhaviṣaya will completely purify their afflictions.

source: །དེ་བས་ན་ཤཱ་རིའི་བུ་གང་གང་ཟག་གིས་གང་ཟག་ལ་དྲོད་མ་གཟུང་ཤིག །
en: Therefore, Śāriputra, people should not appraise other people.

source: གང་ཟག་གིས་གང་ཟག་ལ་དྲོད་བཟུང་ན་ཉམས་པར་འགྱུར་རོ།
en: If a person appraises another person, they will be in error.

source: དེ་བཞིན་གཤེགས་པའམ། གང་ང་དང་འདྲ་བས་ནི་གང་ཟག་ལ་དྲོད་ཟིན་ཏོ།
en: Only a thus-gone one and those like me can appraise a person.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་དང་། ཐམས་ཅད་ཡོད་པའི་འཁོར་དེ་ངོ་མཚར་ཐོབ་ནས་ཆེད་དུ་བརྗོད་པ་ཆེད་དུ་བརྗོད་ཅིང་། བཅོམ་ལྡན་འདས་བདག་ཅག་ནི་དེང་ཕན་ཆད་སེམས་ཅན་གང་ལ་ཡང་སེམས་ཅན་དམྱལ་བར་མཆི་བར་མཐུས་ལུང་མི་སྟོན་ཏོ།
en: Venerable Śāriputra and the entire assembly were amazed, and so they exclaimed, “Blessed One, until today you have not prophesied to us about anyone who was to go to hell.

source: བཅོམ་ལྡན་འདས་སེམས་ཅན་གྱི་སྤྱོད་པ་ནི་བསམ་གྱིས་མི་ཁྱབ་བོ་ཞེས་དེ་སྐད་ཀྱང་སྨྲའོ།
en: Because, Blessed One, the conduct of beings is inconceivable.”

source: །རྒྱལ་པོ་མ་སྐྱེས་དགྲ་ལུང་སྟོན་པའི་བསྟན་པ་འདི་བསྟན་པའི་ཚེ་ལྷའི་བུ་སུམ་ཁྲི་ཉིས་སྟོང་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པར་གྱུར་ཏོ། །གང་གི་ཚེ་ན་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཡུལ་ཤིན་ཏུ་རྣམ་པར་དག་པས་བྱང་ཆུབ་ཐོབ་པར་གྱུར་པ་དེའི་ཚེ། བདག་ཅག་ཀྱང་འཇིག་རྟེན་གྱི་ཁམས་འདམ་གྱི་དྲི་མ་མེད་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དེར་སྐྱེ་བར་ཤོག་ཤིག་ཅེས་སངས་རྒྱས་ཀྱི་ཞིང་དེར་སྐྱེ་བར་སྨོན་ལམ་ཡང་བཏབ་བོ།
en: When King Ajātaśatru’s prophecy was given, thirty-two thousand gods developed the mind directed toward unsurpassed and perfect awakening and made the aspiration to be born in his buddha realm, saying, “When the blessed, thus-gone, worthy, perfect buddha Suviśuddhaviṣaya attains awakening, may we be born in his buddha realm—the world Free of Sullying Mud.”

source: །དེ་དག་ཐམས་ཅད་ཀྱང་སངས་རྒྱས་ཀྱི་ཞིང་དེར་སྐྱེ་བར་བཅོམ་ལྡན་འདས་ཀྱིས་ཀྱང་ལུང་བསྟན་ཏོ།
en: The Blessed One then gave his prophecy that they would all be born in that buddha realm.

source: །དེ་ནས་རྒྱལ་པོ་མ་སྐྱེས་དགྲའི་བུ་ན་ཚོད་ཀྱིས་ལོ་བརྒྱད་ལོན་པའི་ཁྱེའུ་ཟླ་བའི་དཔལ་ཞེས་བྱ་བ་དེས་མགུལ་པ་ནས་རྒྱན་བཀྲོལ་ཏེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་གཏོར་ནས་འདི་སྐད་ཀྱི་ཚིག་ཀྱང་སྨྲས་སོ། །བཅོམ་ལྡན་འདས་བདག་དགེ་བའི་རྩ་བ་འདི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་བསྔོའོ།
en: At this point King Ajātaśatru’s eight-year-old son Moonlike Splendor removed his necklace and tossed it toward the Blessed One, saying, “Blessed One, I dedicate my roots of virtue to unsurpassed and perfect awakening.

source: །བཅོམ་ལྡན་འདས་བདག་གི་དགེ་བའི་རྩ་བ་འདིས་ནམ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཡུལ་ཤིན་ཏུ་རྣམ་པར་དག་པས་བྱང་ཆུབ་ཐོབ་པར་གྱུར་པ་དེའི་ཚེ། བདག་སངས་རྒྱས་ཀྱི་ཞིང་དེར་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོར་གྱུར་ལ།
en: Blessed One, through my roots of virtue, when the blessed thus-gone, worthy, perfect Buddha Suviśuddhaviṣaya attains awakening, may I become a universal monarch in his buddha realm.

source: བདག་གིས་ནམ་འཚོའི་བར་དུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་དགེ་སློང་གི་དགེ་འདུན་དང་བཅས་པ་ལ་བསྙེན་བཀུར་བགྱི་བ་དང་།
en: May I serve the thus-gone, worthy, perfect Buddha and his saṅgha of monks for as long as I live.

source: དེ་བཞིན་གཤེགས་པ་དེ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་སྐུ་གདུང་ལ་ཡང་བདག་མཆོད་པ་བགྱིད་པར་གྱུར་ཅིག །
en: May I venerate the relics left behind when the Thus-Gone One attains parinirvāṇa.

source: བཅོམ་ལྡན་འདས་དེ་མྱ་ངན་ལས་འདས་ནས་ཀྱང་འཇིག་རྟེན་གྱི་ཁམས་དེ་ཉིད་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པར་གྱུར་ཅིག་ཅེས་རྒྱན་དེ་དག་གཏོར་མ་ཐག་ཏུ།
en: Once the blessed one has entered parinirvāṇa, may I fully awaken to unsurpassed and perfect buddhahood in that world.”

source: དེ་ནས་སངས་རྒྱས་ཀྱི་མཐུས་དེའི་ཚེ་སྟེང་གི་བར་སྣང་ལ་རིན་པོ་ཆེ་སྣ་བདུན་ལས་བྱས་པའི་ཁང་པ་རྩེག་མ་ཆ་མཉམ་པ། ཤིན་ཏུ་ཕྱེ་བ་ཞིག་འདུག་པར་གྱུར་ཏེ།
en: As soon as he tossed the necklace, through the power of the Buddha, a multistory mansion appeared in the sky above. It was made of the seven precious materials and had even proportions and exquisite detail.

source: ཁང་པ་རྩེག་མ་དེ་ན་ཁྲི་རིན་པོ་ཆེས་སྤྲས་པའི་རྩ་བ་བཙུགས་པ། གོས་བཀྲམ་པ་ཞིག་བྱུང་བར་གྱུར་ཏེ།
en: In that mansion was a throne studded with jewels and draped in cloth.

source: ཁྲི་དེ་ལ་ཡང་དེ་བཞིན་གཤེགས་པའི་སྐུ་མཚན་ཉིད་ཀྱིས་ཀུན་དུ་བརྒྱན་པ་ཞིག་བཞུགས་པར་སྣང་ངོ་།
en: The form of the Thus-Gone One appeared seated on the throne, adorned with all the marks.

source: །དེ་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་འཛུམ་པ་མཛད་པ་དང་།
en: At that moment, the Blessed One smiled.

source: ཆོས་ཉིད་ཀྱིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་འཛུམ་པ་མཛད་པ་དེའི་ཚེ། བཅོམ་ལྡན་འདས་ཀྱི་ཞལ་ནས་འོད་ཟེར་ཁ་དོག་དུ་མ་སྣ་ཚོགས་འབྱུང་བ་འདི་ལྟ་སྟེ། སྔོན་པོ་དང་། སེར་པོ་དང་། དམར་པོ་དང་།
en: It is the nature of things that when a blessed buddha smiles, variegated light streams forth from the Thus-Gone One’s mouth in the colors of blue, yellow, red, white, green, crystalline, and silver.

source: དཀར་པོ་དང་། ཇ་གོང་དང་། ཤེལ་གྱི་ཁ་དོག་དང་། དངུལ་གྱི་ཁ་དོག་དག་བྱུང་བ་དེ་དག་གིས་འཇིག་རྟེན་གྱི་ཁམས་མཐའ་ཡས་མུ་མེད་པར་ཁྱབ་པར་བྱས་ནས་ཚངས་པའི་འཇིག་རྟེན་གྱི་བར་དུ་སོང་སྟེ།
en: The light pervaded limitless worlds as far as the Brahmā world.

source: ཉི་མ་དང་། ཟླ་བའི་འོད་ཟིལ་གྱིས་མནན་ནས་སླར་ལོག་སྟེ།
en: It outshone the light of the sun and moon and then returned.

source: བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་སྤྱི་བོར་མི་སྣང་བར་སོང་ངོ་།
en: Encircling the Blessed One three times, the light disappeared into the Blessed One’s crown.

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་དགའ་བོ་སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ལ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ།
en: Seeing this, venerable Nanda rose from his seat, draped his shawl over one shoulder, and knelt on his right knee.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པ་འདི་དག་གསོལ་ཏོ། །ཡེ་ཤེས་ཁྱད་པར་ཐམས་ཅད་ཕ་རོལ་ཕྱིན་པ་ཐུབ་པ་ཆགས་མེད་འོད་གཏོང་བ།
en: With palms joined, he bowed toward the Blessed One and spoke the following verses: “With all wisdom qualities perfected—Sage, you radiate boundless light.

source: །སེམས་ཅན་ཕ་རོལ་གྱི་ནི་སེམས་ཀྱི་སྤྱོད་པ་གང་གི་ཅི་འདྲ་བ་ཡང་མཁྱེན།
en: You know accurately the mental actions of others.

source: །དབང་པོ་སྣ་ཚོགས་མཁྱེན་ནས་ཁྱོད་ཀྱང་ཆོས་རྣམས་དེ་བཞིན་དུ་ནི་འཆད་མཛད་པ།
en: Knowing the various faculties, you teach about phenomena accordingly.

source: །ཁྱོད་ཀྱིས་ཅི་ཕྱིར་བདག་ལ་འཛུམ་པ་བསྟན་པ་འགྲོ་བ་ཀུན་གྱི་མཆོག་གསུངས་ཤིག །
en: O supreme among all beings, explain to me why you displayed your smile. “

source: སེམས་ཅན་ཕྱོགས་བཅུ་དག་ན་གནས་པ་ཀུན་ཀྱང་ཁྱོད་ཀྱི་མདུན་དུ་འདུག་གྱུར་ཏེ། །ཐུབ་པ་ལ་ནི་རེ་རེ་ཞིང་ཡང་ཞུ་བ་བྱེ་བ་ཁྲག་ཁྲིག་ཞུ་བགྱིད་ཀྱང་། །ཁྱོད་ཀྱིས་སྐད་ཅིག་ཉིད་དུ་དེ་དག་གི་ནི་ཐེ་ཙོམ་མ་ལུས་གཅོད་པར་མཛད།
en: Even if all the beings living in the ten directions were present before you And presented billions of requests to the Sage, You could cut through all their doubts without exception in a single instant.

source: །འཇིག་རྟེན་མགོན་པོ་ཁྱོད་ཀྱིས་འཛུམ་པ་བསྟན་པ་དེ་ཡི་རྒྱུ་ནི་བདག་ལ་གསུངས།
en: World Protector, please tell me what caused you to smile. “

source: །སངས་རྒྱས་གང་དག་འདས་དང་སྟོབས་བཅུ་ལྡན་པའི་རྒྱལ་བ་གང་དག་བཞུགས་པ་དང་། །གང་དག་རྒྱལ་བ་མང་པོ་མ་བྱོན་རྣམས་དང་སེམས་ཅན་རྣམས་ནི་དཔག་མེད་པ།
en: The buddhas who have passed, the current victors with the ten strengths, The many victors yet to come, and all other beings are innumerable.

source: །ཐམས་ཅད་ཕ་རོལ་ཕྱིན་པ་ཁྱོད་ཀྱིས་དེ་དག་མཁྱེན་ཅིང་གང་ལའང་ཆགས་པ་མེད།
en: You know all the perfections, and you are without attachment to anything.

source: །ཅི་ཡི་སླད་དུ་འཛུམ་པ་བསྟན་པ་རྡུལ་དང་བྲལ་བས་བདག་གི་ཐེ་ཙོམ་ཆོད།
en: Why have you smiled? Stainless One, please eliminate my doubt. “

source: །ཁྱོད་ཀྱི་འོད་ཀྱིས་ཚངས་པ་དབང་པོ་ཉི་མ་ཟླ་བ་ལྷ་རྣམས་ཟིལ་གྱིས་མནན།
en: With your light you eclipse Brahmā, Indra, the sun, the moon, and the gods.

source: །རི་དང་ཁོར་ཡུག་རྩེ་མོ་དག་ལས་ཐལ་ནས་ཁྱོད་ཀྱི་འོད་ཀྱང་གསལ་བར་གདའ།
en: Surpassing the mountain and its environs, your light is bright.

source: །རེག་ནས་སེམས་ཅན་བརྒྱ་དག་བདེ་བས་དགའ་ཞིང་ཉོན་མོངས་པ་ཡང་ལྡང་མི་འགྱུར།
en: When touched, hundreds of beings are pleased and never again fall into affliction.

source: །ཉོན་མོངས་ཐམས་ཅད་དགྲོལ་བ་ཁྱོད་ཀྱིས་འཛུམ་འདི་ཅི་ཕྱིར་མཛད་པ་བདག་ལ་གསུངས།
en: You who are freed from all affliction, please explain to me why you have smiled.”

source: །དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་དགའ་བོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །དགའ་བོ་ཁྱོད་ཀྱིས་ཁྱེའུ་ཟླ་བའི་དཔལ་འདི་མཐོང་ངམ།
en: The Blessed One then spoke to venerable Nanda, “Nanda, do you see the boy Moonlike Splendor?” “

source: དགའ་བོ་ཁྱེའུ་ཟླ་བའི་དཔལ་འདིས་ངའི་དྲུང་དུ་དགེ་བའི་རྩ་བ་བསྐྱེད་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སྨོན་ལམ་བཏབ་སྟེ།
en: The Blessed One continued, “Nanda, Moonlike Splendor generated roots of virtue before me and aspired to unsurpassed and perfect awakening.

source: དགའ་བོ་ཁྱེའུ་འདིས་རིམ་གྱིས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་སྤྱད་ནས་ནམ་དེ་བཞིན་གཤེགས་པ་ཡུལ་ཤིན་ཏུ་རྣམ་པར་དག་པས་བྱང་ཆུབ་ཐོབ་པར་འགྱུར་བ་དེའི་ཚེ། ཁྱེའུ་ཟླ་བའི་དཔལ་འདི་ཡང་འཇིག་རྟེན་གྱི་ཁམས་དེར་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོར་འགྱུར་ཏེ།
en: Nanda, this boy will gradually train in bodhisattva conduct, and then when the thus-gone Suviśuddhaviṣaya attains awakening, the boy Moonlike Splendor will become the universal monarch in that world.

source: དེས་དེ་བཞིན་གཤེགས་པ་ཡུལ་ཤིན་ཏུ་རྣམ་པར་དག་པ་དགེ་སློང་གི་དགེ་འདུན་དང་བཅས་པ་དེ་ལ་ནམ་འཚོའི་བར་དུ་བཀུར་སྟི་བྱེད་པར་འགྱུར། བསྟི་སྟང་བྱེད་པར་འགྱུར། རིམ་གྲོ་བྱེད་པར་འགྱུར། མཆོད་པ་བྱེད་པར་འགྱུར་རོ།
en: He will serve, honor, respect, and venerate the thus-gone Suviśuddhaviṣaya and his saṅgha of monks for as long as that thus-gone one lives.

source: །དེ་བཞིན་གཤེགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་ཀྱང་སྐུ་གདུང་ལ་མཆོད་པ་བྱེད་པར་འགྱུར་རོ།
en: After the Thus-Gone One passes into parinirvāṇa, he will venerate his relics.

source: །དེ་ནི་དེར་དེ་བཞིན་གཤེགས་པ་ཡང་ཡོངས་སུ་མྱ་ངན་ལས་འདས། དེ་ནས་བསྟན་པ་ཡང་ནུབ་ནས་དགའ་ལྡན་དུ་ཚེ་ཟད་པར་བྱས་ཏེ།
en: When the Thus-Gone One has entered parinirvāṇa and his teachings have likewise ceased, he will live out his lifespan in the Heaven of Joy.

source: བསྐལ་པ་དེ་ཉིད་ལ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཏེ། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཟླ་བའི་དཔལ་ཞེས་བྱ་བར་འགྱུར་རོ།
en: In that eon, he will awaken to unsurpassed and perfect buddhahood, becoming the thus-gone, worthy, perfect Buddha Moonlike Splendor.

source: །སངས་རྒྱས་ཀྱི་ཞིང་ཡང་དེ་དང་འདྲ་བ། ཚེའི་ཚད་ཀྱང་དེ་དང་མཉམ་པ། ཉན་ཐོས་ཀྱི་དགེ་འདུན་ཡང་དེ་དང་མཉམ་པ། བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་ཡང་དེ་དང་མཉམ་པར་འགྱུར་རོ།
en: His buddha realm will be similar, his lifespan will be equal, his saṅgha of hearers will be equal, and his bodhisattva saṅgha will be equal to those of the thus-gone Suviśuddhaviṣaya.”

source: །དེ་ནས་གང་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་དང་འགྲོགས་ཏེ། འཇིག་རྟེན་གྱི་ཁམས་གཞན་ནས་འཇིག་རྟེན་གྱི་ཁམས་འདིར་ཕྱིན་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གིས་བསྟན་པ་འདི་ཐོས་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ས་ཕྱོགས་གང་ན་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་གནས་པ་དེ་ན་དེ་བཞིན་གཤེགས་པས་སྟོང་པ་མ་ལགས་ཏེ།
en: When those bodhisattvas who had accompanied Mañjuśrī Kumārabhūta, coming from another world to this one, heard this teaching, they said to the Blessed One, “Blessed One, wherever Mañjuśrī Kumārabhūta lives, that place is not devoid of a thus-gone one.

source: དེར་ནི་བཅོམ་ལྡན་འདས་ཀྱིས་དགོངས་པར་བགྱི་མི་འཚལ་ལོ།
en: However, there they will not seek the intent of the Blessed One.

source: བཅོམ་ལྡན་འདས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་ཡོངས་སུ་ཟིན་པའི་སེམས་ཅན་རྣམས་ནི་འགྲོ་བ་ངན་པའི་འཇིགས་པའམ། མི་ཁོམ་པའི་འཇིགས་པའམ། བདུད་ཀྱི་ལས་ཀྱི་འཇིགས་པའམ། ཉོན་མོངས་པའི་འཇིགས་པ་མ་མཆིས་སོ། །བཅོམ་ལྡན་འདས་གྲོང་ངམ། གྲོང་ཁྱེར་རམ།
en: Blessed One, beings who are embraced by Mañjuśrī Kumārabhūta do not fear the lower realms, the unfree states, the activity of Māra, or the afflictions. “

source: གྲོང་འདབ་བམ། གཞོངས་སམ། གཞོངས་ཀྱི་ཕྱོགས་སམ། གཙུག་ལག་ཁང་ངམ། དགོན་པ་གང་ན་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་སྤྱོད་པར་འགྱུར་བའི་ས་ཕྱོགས་དེ་ཡང་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པས་སྟོང་པ་མ་ལགས་སོ།
en: Blessed One, any village, town, city, area, locale, temple, or forest wherein this Dharma teaching is practiced is not devoid of a thus-gone one.

source: གང་ན་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་སྤྱོད་པར་འགྱུར་བ་དེ་ན་དེ་བཞིན་གཤེགས་པ་ཉིད་དུ་བརྩོན་པར་བལྟ་བར་བགྱིའོ།
en: Wherever this Dharma teaching is practiced, that place will be seen as having the presence of the thus-gone ones themselves.

source: །གང་ན་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་སྤྱོད་པའི་ས་ཕྱོགས་དེ་ནི་དེ་བཞིན་གཤེགས་པས་ཡོངས་སུ་སྤྱད་པར་བལྟ་བར་བགྱིའོ།
en: Wherever this Dharma teaching is practiced, that place will be seen as a place where the thus-gone ones are present.”

source: །དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །དེ་དེ་བཞིན་ནོ།
en: The Blessed One then said to these bodhisattvas, “Thus it is.

source: །རིགས་ཀྱི་བུ་ཇི་སྐད་སྨྲས་པ་དེ་བཞིན་ཏེ།
en: Noble sons, it is as you have said.

source: གང་ན་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་སྤྱོད་པར་འགྱུར་བའི་ས་ཕྱོགས་དེ་ནི་དེ་བཞིན་གཤེགས་པས་སྤྱོད་པ་ཡིན་ནོ།
en: Any place where this Dharma teaching is practiced, the thus-gone ones are present.

source: རིགས་ཀྱི་བུ་དག་སྔོན་འདས་པའི་དུས་ན་དེ་བཞིན་གཤེགས་པ་མར་མེ་མཛད་ཀྱིས་ང་ལུང་བསྟན་པར་གྱུར་ནས།
en: Noble sons, in the past, the thus-gone Dīpaṅkara gave me a prophesy.

source: སའི་ཕྱོགས་གང་དུ་ངས་རལ་པ་བཏིང་ཞིང་ངས་བཟོད་པ་ཐོབ་པར་གྱུར་པ་དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མར་མེ་མཛད་ཀྱིས་ང་བཟོད་པ་ཐོབ་པར་མཁྱེན་ནས།
en: Following that, I scattered my hair on the ground and attained acceptance.

source: ཁྱེའུ་འདི་བསྐལ་པ་གྲངས་མེད་པ་ན་ཤཱཀྱ་ཐུབ་པ་ཞེས་བྱ་བའི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སུ་འགྱུར་རོ་ཞེས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་ཏོ།
en: Seeing that I had attained acceptance, the thus-gone, worthy, perfect Buddha Dīpaṅkara prophesied my unsurpassed and perfect awakening by saying, ‘In one countless eon, this boy will become a thus-gone, worthy, perfect buddha known as Śākyamuni.’ “

source: །དེ་ན་དེ་བཞིན་གཤེགས་པ་མར་མེ་མཛད་དེས། དགེ་སློང་གི་དགེ་འདུན་ལ་དགེ་སློང་དག་ཁྱེད་སུས་ཀྱང་སའི་ཕྱོགས་འདི་རྐང་པས་མ་བཅག་ཤིག །
en: The thus-gone Dīpaṅkara then said to the saṅgha of monks, ‘Monks, none of you should set foot on this spot.

source: གང་དུ་ཁྱེའུ་འདིས་རལ་པ་བཏིང་ཞིང་བཟོད་པ་ཐོབ་པ་དེ་ནི་ལྷ་དང་མིའི་འཇིག་རྟེན་དུ་བཅས་པའི་མཆོད་རྟེན་ཡིན་ནོ།
en: This place where this boy has scattered his locks and attained acceptance will become an object of veneration by the world of gods and humans.

source: །ཡང་སའི་ཕྱོགས་འདིར་མཆོད་རྟེན་བྱེད་པར་སྤྲོ་ཞེས་དེ་སྐད་བཀའ་སྩལ་པ་དང་།
en: Moreover, would any one of you be delighted to build a stūpa here?’ “

source: རིགས་ཀྱི་བུ་དག་དེ་ན་ལྷ་བྱེ་བ་ཕྲག་བརྒྱད་ཅུས་བཅོམ་ལྡན་འདས་ས་ཕྱོགས་འདིར་མཆོད་རྟེན་བགྱི་བར་བདག་ཅག་སྤྲོའོ་ཞེས་མགྲིན་གཅིག་ཏུ་ཚིག་སྨྲས་སོ།
en: At that point, noble sons, eight hundred million gods said with one voice, ‘Blessed One, we are delighted to build a stūpa here.’

source: །དེ་ན་ཁྱིམ་བདག་ལྷ་བཟང་ཞེས་བྱ་བ་ཞིག་འཁོར་དེར་འདུས་པར་གྱུར་པ་དེས་ཀྱང་བཅོམ་ལྡན་འདས་བདག་གིས་ས་ཕྱོགས་འདིར་མཆོད་རྟེན་བགྱི་བར་སྤྲོའོ། །ཞེས་སྨྲས་ཏེ།
en: A householder present in the assembly named Bhadradeva said, ‘Blessed One, I am also delighted to build a stūpa here.’ “

source: རིགས་ཀྱི་བུ་དག་ས་ཕྱོགས་དེར་ཁྱིམ་བདག་ལྷ་བཟང་ཞེས་བྱ་བ་དེས་མཆོད་རྟེན་རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ་ཞིག་བྱས་སོ།
en: Noble sons, in that place the householder Bhadradeva then built a stūpa adorned with all manner of ornaments.

source: །བྱས་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་པ་དང་། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་གིས་ས་ཕྱོགས་དེར་རིན་པོ་ཆེ་སྣ་བདུན་ལས་མཆོད་རྟེན་བགྱིས་ན་བཅོམ་ལྡན་འདས་བདག་གིས་བསོད་ནམས་ཇི་ཙམ་ཞིག་བགྱིས་པར་གྱུར། དེ་སྐད་ཅེས་གསོལ་པ་དང་།
en: Having built it, he went before the Blessed One and asked, ‘Blessed One, given that I have built a stūpa of the seven precious materials in this place, how much merit have I made?’ “

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མར་མེ་མཛད་ཀྱིས་ཁྱིམ་བདག་ལྷ་བཟང་ལ་སའི་ཕྱོགས་གང་དུ་བྱང་ཆུབ་སེམས་དཔའ་བཟོད་པ་ཐོབ་པའི་ས་ཕྱོགས་དེ་ན་ཤིང་རྟའི་འཁོར་ལོ་ཙམ་གྱི་ས་ཇི་སྙེད་པ་འོག་ཏུ་ཆུའི་ཕུང་པོ་ལ་ཐུག་གི་བར་དུ་ས་ཆེན་པོ་དེ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་མཆོད་རྟེན་དུ་གྱུར་པ་ཡིན་ཏེ།
en: The thus-gone, worthy, perfect Buddha Dīpaṅkara responded to the householder Bhadradeva, ‘The earth beneath the place where the bodhisattva attained acceptance—which is the size of a wagon wheel and extends down to meet the mass of water below—is a place of veneration for all beings.

source: ཁྱིམ་བདག་གང་གིས་ཆུའི་ཕུང་པོ་ནས་འཁོར་བའི་རྩེ་མོའི་བར་དུ་རིན་པོ་ཆེ་སྣ་བདུན་གྱིས་བཀང་སྟེ་དེ་བཞིན་གཤེགས་པ་ལ་ཕུལ་བ་པས།
en: Householder, even if someone were to fill the space from the mass of water below up to the peak of saṃsāra with the seven precious materials and offer it to the thus-gone ones, your construction of this stūpa surely results in comparatively far more merit.

source: གང་ཁྱོད་ཀྱིས་མཆོད་རྟེན་བྱས་པ་འདི་དེ་བས་བསོད་ནམས་ཤིན་ཏུ་མང་མོད་ཀྱི། ཁྱིམ་བདག་དགེ་བའི་རྩ་བ་འདིས་ནི་ཇི་ལྟར་ཁྱེའུ་འདི་ངས་ད་ལྟར་ལུང་བསྟན་པ་དེ་བཞིན་དུ་འདི་བྱང་ཆུབ་ཐོབ་ནས་ཁྱོད་ལ་ལུང་སྟོན་པར་འགྱུར་རོ་ཞེས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རིགས་ཀྱི་བུ་དག་ཇི་སྙམ་དུ་སེམས།
en: Householder, because of this root of merit, once he attains awakening he will give a prophesy to you, just as I have now given a prophesy to this boy. “

source: དེའི་ཚེ་དེའི་དུས་ན་ཁྱིམ་བདག་ལྷ་བཟང་ཞེས་བྱ་བ་དེ་གཞན་དུ་གྱུར་པ་སྙམ་དུ་དེ་ལྟར་མ་ལྟ་ཞིག །
en: Tell me, Noble sons, is the one who at that time was the householder Bhadradeva someone unknown to you? Do not think this way.

source: ཁྱིམ་བདག་གི་བུ་དགའ་བ་སྤྱོད་པ་ཞེས་བྱ་བ་འདི་ཉིད་དེའི་ཚེ་དེའི་དུས་ན་ཁྱིམ་བདག་ལྷ་བཟང་ཞེས་བྱ་བར་གྱུར་ཏེ།
en: This son of the householder named Immersed in Joy was at that time the householder Bhadradeva.

source: འདི་ཡང་ངས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པ་སྟེ།
en: I now prophesy that he will awaken to unsurpassed and perfect buddhahood.

source: མ་འོངས་པའི་དུས་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བལྟ་ན་བཟང་ཞེས་བྱ་བར་འགྱུར་རོ། །དེ་བས་ན་རིགས་ཀྱི་བུ་དག་དགེ་སློང་ངམ། དགེ་སློང་མའམ། དགེ་བསྙེན་ནམ། དགེ་བསྙེན་མ་འདུག་ཀྱང་རུང་། འགྲེང་ཡང་རུང་སྟེ།
en: In the future he will become the thus-gone, worthy, perfect Buddha Excellent Teaching. “

source: ཆོས་ཀྱི་རྣམ་གྲངས་འདི་འདྲིའམ། ཀློག་གམ། ཁ་ཏོན་བྱེད་དམ། ཁ་ཏོན་ཞུའམ། འཆད་ན་འོག་གི་ཆུའི་ཕུང་པོ་ནས་སའི་ཕྱོགས་དེའི་བར་གྱི་རྡུལ་དེ་ཐམས་ཅད་སེམས་ཅན་ཐམས་ཅད་ཀྱི་མཆོད་རྟེན་དུ་གྱུར་པར་བལྟའོ།
en: Therefore, noble sons, should any monk, nun, layman, or laywoman, whether seated or standing, inquire into, read, recite, request the reciting of, or explain this Dharma teaching, every particle in the earth below them down to the mass of water should be seen as a place of veneration for all beings.

source: ཆོས་འདི་དག་ཉིད་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་བཟོད་པ་ཐོབ་པར་འགྱུར་བའོ།
en: Through such teachings bodhisattva great beings will gain acceptance.

source: །རིགས་ཀྱི་བུ་དག་ཁྱེད་ལ་བསྒོའོ། །ཁྱེད་ཀྱི་ཁོང་དུ་ཆུད་པར་བྱའོ།
en: Noble sons, I instruct you: this is for you to understand.

source: །རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་གིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་རིན་པོ་ཆེ་སྣ་བདུན་གྱིས་བཀང་སྟེ། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པ་རྣམས་ལ་རྒྱུན་མ་ཆད་ཅིང་ལས་གཞན་མི་བྱེད་པར་ཉིན་ལན་གསུམ་མཚན་ལན་གསུམ་འབུལ་བ་བས་གང་གིས་རྒྱལ་པོ་མ་སྐྱེས་དགྲའི་ལེའུ་ཐེ་ཙོམ་ཐམས་ཅད་གཅོད་པར་བྱེད་པ། འགྱོད་པ་ཐམས་ཅད་སེལ་བར་བྱེད་པ། ལས་ཀྱི་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སྦྱོང་བར་བྱེད་པ།
en: Imagine that a noble son or daughter were to fill the great trichiliocosm with the seven precious materials and offer them continuously to the thus-gone, worthy, perfect buddhas and their saṅghas of hearers, without engaging in any other action, for three days and three nights.

source: ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་དུ་སྟོན་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་འཛིན་ཏམ། ལེན་ཏམ། ཀློག་གམ། ཀུན་ཆུབ་པར་བྱེད་དམ། འཆད་དམ། ཉན་ཏམ། མོས་པར་བྱེད་དམ། ཆུང་ངུ་ན་དམ་པའི་ཆོས་ཡུན་རིང་དུ་གནས་པར་བྱ་བའི་ཕྱིར། གླེགས་བམ་དུ་བྲིས་ཏེ་འཆང་ན། འདི་ནི་དེ་བས་ཤིན་ཏུ་བསོད་ནམས་མང་དུ་འཕེལ་ལོ།
en: Compared to that, if someone were to hold, receive, read, understand, explain, listen to, trust in, or even write down and carry this Dharma teaching in order to ensure the longevity of this Dharma teaching of King Ajātaśatru’s chapter—which cuts through all doubt, eliminates all remorse, purifies all karmic obscurations, and teaches the sameness of all phenomena—that person’s merit will be far greater. “

source: །རིགས་ཀྱི་བུ་དག་གང་གིས་བསྐལ་པའམ། བསྐལ་པའི་ལྷག་མ་ལུས་ཀྱི་བར་དུ་ཚུལ་ཁྲིམས་སྲུང་ཞིང་སྦྱངས་པའི་ཡོན་ཏན་དང་། ཆོག་ཤེས་པ་ཐམས་ཅད་ལ་དགའ་བར་འགྱུར་བ་བས། གང་གིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཐོས་མ་ཐག་ཏུ་མོས་པར་བྱེད་ན། འདི་ནི་དེ་བས་བསོད་ནམས་ཤིན་ཏུ་མང་དུ་འཕེལ་ལོ།
en: Noble sons, compared to maintaining discipline and delighting in the ascetic practices and contentment for an eon or even more than an eon, if one trusts this Dharma teaching immediately upon hearing it, one’s merit will be far greater. “

source: །རིགས་ཀྱི་བུ་དག་གང་གིས་བསྐལ་པའམ། བསྐལ་པའི་ལྷག་མ་ལུས་ཀྱི་བར་དུ་བཟོད་པས་སྒྲུབ་ཅིང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ངན་དུ་སྨྲ་བ་དང་། རྡེག་པར་བྱེད་པ་བཟོད་པ་བས། གང་གིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་ཆོས་ལ་བཟོད་པ་དེ་ནི་བཟོད་པ་དེ་བས་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཤིན་ཏུ་མཆོག་ཏུ་འཕེལ་བར་འགྱུར་རོ། །རིགས་ཀྱི་བུ་དག་གང་གིས་བསྐལ་པའམ།
en: Noble sons, compared to practicing patience and forbearing the ill speech and physical abuse of all beings for an eon or even more than an eon, if one has acceptance of the Dharma in this Dharma teaching, one’s merit will be far greater through that acceptance. “

source: བསྐལ་པའི་ལྷག་མ་ལུས་ཀྱི་བར་དུ་སེམས་ཅན་ཐམས་ཅད་ལ་ཉོན་མ་མོངས་ཤིང་། ལུས་དང་སྲོག་ལ་མི་ལྟ་བར་བསྙེན་བཀུར་བྱེད་པ་བས། གང་གིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་ཡིད་ཆེས་ཤིང་ཐེ་ཙོམ་མི་སྐྱེད་ན་བརྩོན་འགྲུས་འདི་ནི་དེ་བས་ཁྱད་དུ་ཞུགས་པ་ཡིན་ནོ། །རིགས་ཀྱི་བུ་དག་གང་གིས་བསྐལ་པའམ། བསྐལ་པའི་ལྷག་མ་ལུས་ཀྱི་བར་དུ་བསམ་གཏན་དང་།
en: Noble sons, compared to not being upset with anyone but instead serving all beings without regard for one’s life and limb for an eon or even more than an eon, if one has confidence in this Dharma teaching and does not doubt it, such diligence will be more exalted. “
